Repository: 84000/data-translation-memory
Catalog: toh93-v4.tmx
Source language: bo
Languages: en

source: དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ཀྱིས་དེ་ལྟར་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཤེས་པར་བྱའོ།
en: Great Seer, you should know those as fully ripened karmic results. “

source: །དྲང་སྲོང་ཆེན་པོ་གཞན་ཡང་སུམ་ཅུ་རྩ་གསུམ་པའི་གནས་ཀྱི་ལྷའི་རིས་དེ་ན་ཤི་རི་ཤ་ཀ་ཞེས་བྱ་བའི་སྐྱེད་མོས་ཚལ་ཡལ་ག་དང་། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: Moreover, Great Seer, there is a garden in the Heaven of the Thirty-Three called Śirīṣaka that is adorned with branches, flowers, and various fruits.

source: ཤིང་བརྒྱ་སྟོང་སྣ་ཚོགས་སྟུག་པ། སྟུག་པོའི་མཐོངས་ན་ཤེལ་ལྟར་དྲི་མ་མེད་པའི་རྡོ་ལེབ་ཤིན་ཏུ་ཕྱི་བདར་བྱས་པ་ཕུན་སུམ་ཚོགས་པ་ཞི་ཞིང་དབང་པོ་རབ་ཏུ་ཞི་བའི་ཐུབ་པ་འདོད་ཆགས་དང་བྲལ་བས་བསྟེན་པ་ཡོད་དེ།
en: It is a thick grove of hundreds of thousands of various trees, and in the central clearing of that thick grove there is an excellent stone slab that is spotless, clear like glass, and kept very clean. There, accomplished sages who are peaceful and whose sense faculties are tranquil sit, free from attachment.

source: དེ་ན་འདོད་པའི་ལོངས་སྤྱོད་ཅན་གྱི་ལྷའི་བུ་དང་། ལྷའི་བུ་མོའི་ཚོགས་མི་གནས་སོ།
en: The groups of gods and goddesses who indulge in desire do not live there. “

source: །དྲང་སྲོང་ཆེན་པོ་སྐྱེད་མོས་ཚལ་དམ་པ་ཤི་རི་ཤ་ཀ་དེ་ན་མེ་ཏོག་དང་འབྲས་བུའི་ཤིང་ལྗོན་པ་མང་པོ་ལས་རྟག་ཏུ་ལྷའི་གཏམ་བརྗོད་པའི་སྒྲ་འབྱུང་ངོ་།
en: Great Seer, in that supreme garden Śirīṣaka, there are many flowering and fruiting trees, and the divine discourses of the gods continually resound from them.

source: །དྲང་སྲོང་ཆེན་པོ་དེ་ན་ཉན་ཐོས་ཀྱི་དགེ་འདུན་འདུས་པའི་གནས་བརྟན་བ་ལང་བདག་བྲམ་ཟེའི་རིགས་སུ་སྐྱེས་པ། བསམ་གཏན་ལ་གནས་པ། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་གནས་པ། བྱམས་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ་འདུག་གོ །
en: An elder from the śrāvaka saṅgha assembly named Gavāṃpati, who was born in the brahmin caste, lives there dwelling in concentration, abiding in compassion, delight, and equanimity, and engaging in the meditative absorption of loving kindness.

source: དྲང་སྲོང་ཆེན་པོ་དེ་ཞག་བདུན་གྱི་བར་དུ་དབུགས་ཕྱི་ནང་དུ་མི་རྒྱུའོ། །དྲང་སྲོང་ཆེན་པོ་དེ་བྱམས་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པའི་ཚེ་འདོད་ན་རླུང་མི་ལྡང་ངོ་།
en: That great seer can remain for seven days without breathing, and, if he so desires, when that great seer enters the meditative absorption of loving kindness the wind does not blow.

source: །དྲང་སྲོང་ཆེན་པོ་དེ་སྲེག་པའི་བསྐལ་པའི་ཚེས་མེ་ལྕེ་གཅིག་ཏུ་གྱུར་པ་ན་ཡང་དེའི་ལུས་ཡུངས་འབྲུ་ཙམ་ཡང་ཚིག་པར་མི་འགྱུར་རོ། །དེའི་ཚིགས་ཀྱིས་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱང་ཕིགས་སོ། །ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་།
en: That great seer’s body is not harmed even slightly in the final conflagration of the eon, when the entire world becomes a single tongue of flame that destroys even Sumeru, the king of mountains.

source: ཉེ་དགའ་སྟོབས་ཆེ་བ། ཆེར་གདུག་པའི་ཤུགས་ཅན་རྫུ་འཕྲུལ་ཆེ་བ། དབུགས་ཀྱིས་ཀྱང་རིའི་རྒྱལ་པོ་རི་རབ་འཇིག་པ། རྒྱ་མཚོ་ཆེན་པོ་བཞི་ཡང་སྐམ་པར་བྱེད་པ། གཏུམ་ཞིང་ཆེར་གདུག་པའི་ཤུགས་ཅན་ཀླུའི་རྒྱལ་པོ་དེ་གཉིས་ཀྱང་དགེ་སློང་བ་ལང་བདག་དེའི་ཏིང་ངེ་འཛིན་གྱི་མཐུས་གདུག་པ་མེད་པར་འགྱུར་རོ།
en: Even the mighty nāga kings Nanda and Upananda, that pair of fierce and powerfully pernicious nāga kings who possess powerful magic and very harmful powers, and can topple Sumeru, the king of mountains, or dry up even the four great oceans with a mere breath, are rendered harmless by the power of the monk Gavāṃpati’s meditative absorption. “

source: །དྲང་སྲོང་ཆེན་པོ་གནས་བརྟན་བ་ལང་བདག་སྐྱེད་མོས་ཚལ་ཤི་རི་ཤ་ཀ་ན་གནས་ཤིང་བསམ་གཏན་ལ་གནས་པར་ལྷ་གཞོན་ནུ་དེ་དག་དང་། ལྷའི་བུ་མོ་དེ་དག་གིས་མཐོང་ནས་གུས་པ་དང་བཅས་རི་མོ་དང་བཅས་པས་གནས་བརྟན་དེ་ལ་དགའ་བ་དང་དད་པ་སྐྱེས་ནས་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། མན་ཛུ་ཥ་ཀ་དང་། མན་ཛུ་ཥ་ཀ་ཆེན་པོ་དང་། ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། དྲི་མཆོག་དང་། པད་མ་དཀར་པོས་གཏོར་ནས་ཐལ་མོ་སྦྱར་བ་བྱས་ཏེ་ཕྱག་འཚལ་ནས།
en: Great Seer, when the young gods and goddesses see the elder Gavāṃpati residing in the garden of Śirīṣaka and dwelling in concentration, with devotion and respect they generate delight and faith in him. They strew upon him divine flowers, such as māndarāva, great māndarāva, mañjūṣaka, great mañjūṣaka, blue lotuses, red lotuses, water lilies, and white lotuses, and then bow before him with their palms together. “

source: སུམ་ཅུ་རྩ་གསུམ་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་ཐམས་ཅད་ཀྱིས་གནས་བརྟན་བ་ལང་བདག་ལ་ཡོངས་སུ་བསྐོར་ཏེ་མཆོད་པ་ཆེན་པོ་བྱས་ནས་མདུན་གྱིས་བལྟས་ཏེ་གནས་ནས་ལྷའི་ཟས་བདུད་རྩིའི་རོ་དང་ལྡན་པས་ཚིམ་པར་བྱེད་ཅིང་ཅི་བདེར་བྱེད་དོ། །
en: After all those gods of the Heaven of the Thirty-Three have surrounded the elder Gavāṃpati and made a great offering, they sit facing him and satiate and please him with divine food that tastes like ambrosia.

source: གནས་བརྟན་བ་ལང་བདག་དེ་ལྷའི་བུ་དེ་དག་ལ་ཆོས་སྟོན་པ་ནི་འདི་ལྟ་སྟེ་མདོའི་སྡེ་དང་། དབྱངས་ཀྱིས་བསྙད་པའི་སྡེ་དང་། ལུང་དུ་བསྟན་པའི་སྡེ་དང་། ཚིགས་སུ་བཅད་པའི་སྡེ་དང་། ཆེད་དུ་བརྗོད་པའི་སྡེ་དང་། གླེང་གཞིའི་སྡེ་དང་། དེ་ལྟ་བུ་བྱུང་བའི་སྡེ་དང་། སྐྱེས་པ་རབས་ཀྱི་སྡེ་དང་། ཤིན་ཏུ་རྒྱས་པའི་སྡེ་དང་། རྨད་དུ་བྱུང་བའི་ཆོས་ཀྱི་སྡེ་དང་། འདུལ་བའི་སྡེ་དང་། མདོ་སྡེའི་ལུང་གི་ཕྱོགས་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། དེ་དག་དགའ་བ་དང་། དད་པ་སྐྱེད་དོ། ། དེ་ལྷའི་སྐྱེད་མོས་ཚལ་དེ་ན་བསམ་གཏན་ལ་གནས་ཏེ་ཐམས་ཅད་བདེ་བ་དང་ལྡན་པར་སྐྱེད་མོས་ཚལ་ཤི་རི་ཤ་ཀ་ན་རྟེན་ཅིང་གནས་སོ།
en: The elder Gavāṃpati teaches those gods the Dharma, in the form of discourses, mingled prose and verse, prophecies, verse, joyful utterances, narratives, moral tales, stories of previous lives, works of great extent, marvels, and didactical works of the Vinaya and Sūtra collections. As a result, the gods are delighted and give rise to faith, and they remain in meditative concentration in that divine garden, living in complete happiness and frequenting the garden of Śirīṣaka. “

source: །དྲང་སྲོང་ཆེན་པོ་གཞན་ཡང་སུམ་ཅུ་རྩ་གསུམ་ལྷའི་རིས་དེ་ན་ལྷའི་འདུན་ས་ཆོས་བཟངས་ཞེས་བྱ་བ་ཡོད་དོ།
en: Great Seer, there is also a divine meeting place in the Heaven of the Thirty-Three called Sudharma.

source: །དེའི་ཀ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་གསེར་དང་། དངུལ་དང་། རྡོ་རྗེ་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་ལས་བྱས་པ།
en: It has eighty-four thousand pillars made of gold, silver, diamond, coral, and emerald.

source: ཙན་དན་མཆོག་ཤིང་གི་སྙིང་པོ་ལ་སོགས་པ་དྲིལ་བུ་གཡེར་ཀ་སྒྲ་སྙན་པའི་དྲ་བས་ཁེབས་པར་བྱས་པ། ས་ཕྱོགས་གསེར་གྱི་བྱེ་མ་བདལ་བའོ། །
en: The uragasāra sandalwood trees and camphor trees and the like are covered with nets of melodiously tinkling bells, and the ground is sprinkled with gold dust.

source: ལྷའི་འདུན་ས་ཆོས་བཟངས་ལྷའི་རས་རབ་ཏུ་སྦྱངས་པ།
en: The divine meeting place Sudharma is decorated with divine cloths.

source: རྒྱལ་མཚན་དང་། གདུགས་དང་། བ་དན་བསྒྲེང་བ་དང་། ལྷའི་རོལ་མོ་ཁོང་ཧུ་དང་། པི་བང་དང་། གླིང་བུ་དང་། རྫ་རྔ་དང་། རྔ་པ་ཊ་ཧ་དང་། ལྕགས་ཀྱི་སིལ་ཁྲོལ་དང་། དུང་དང་། པི་བང་རྒྱུད་གསུམ་པ་རབ་ཏུ་སྒྲོགས་པ། ག་ཞ་དང་། སིལ་ཁྲོལ་དང་། ཅ་ཅོའི་སྒྲ་སྙན་པ་འབྱིན་པ་དང་ལྡན་པ།
en: Within it, banners, parasols, and flags are raised, and divine music rings out from such instruments as lutes, flutes, clay drums, paṭaha drums, small bells of iron, conch shells, and three-stringed lutes. One can also hear melodious sounds of laughter, small bells tinkling on clothes, and the clamor of voices.

source: མེ་ཏོག་དང་། འབྲས་བུ་དང་། ཡལ་ག་དང་། ཁུ་བྱུག་གནས་ཤིང་ཕན་ཚུན་ནས་སྒྲ་འབྱིན་པ་དེ་ན་ལྷ་དང་།
en: There are flowers, fruits, and branches, and one can hear the melodious songs of cuckoos calling back and forth from their separate roosts.

source: ལྷ་མོ་དེ་དག་དགའ་བ་དང་། བདེ་བ་སྐྱེ་བའི་བཞིན་གྱིས་གནས་སོ།
en: Gods and goddesses dwell there, their faces beaming with joy and happiness. “

source: །དྲང་སྲོང་ཆེན་པོ་ལྷའི་འདུན་ས་ཆོས་བཟངས་དེའི་སའི་ངོས་ནོར་བུ་རིན་པོ་ཆེས་རབ་ཏུ་སྤྲས་པ།
en: Great Seer, the surface of the ground in the divine meeting place Sudharma is decorated with precious jewels.

source: ལྗང་གུས་བྱུགས་པས་མདོག་སྣུམ་ཞིང་བཻ་དཱུརྱ་ལྟར་དྲི་མ་མེད་དེ།
en: It is glossy, coated with green, and pure like beryl.

source: མེ་ལོང་གི་ངོས་ལྟ་བུར་བྱས་པ་རབ་ཏུ་འཇམ་པ་ན་སྤོས་ཀྱི་ཕྱེ་མ་དང་། མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་འཐོར་བ།
en: It is smooth like the surface of a mirror and strewn with perfumed powders and various flowers.

source: རླུང་དང་། ཉི་མ་དང་། ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་། སྦྲུལ་གྱི་ཉེས་པ་ཡོངས་སུ་སྤངས་པ།
en: It is free of such faults as harsh wind, hot sun, flies, bees, and snakes.

source: ངང་གིས་གཉིད་དང་། སྙོམ་པ་དང་། ལེ་ལོ་རྣམ་པར་སྤངས་པ་མཐོང་ཁུང་དང་། སྐར་ཁུང་ཟླ་ཁམ་ལྟ་བུའི་དྲ་བའི་བུ་གནས་རེག་ན་བདེ་བའི་རླུང་གཏོང་བ།
en: It is naturally free of sleepiness, torpor, and laziness, and gentle breezes blow through the openings of its skylights, windows, and lattices shaped like crescent moons.

source: རྟ་བབས་དང་། ཡང་ཏོག་དང་། ཡང་ཏོག་ཆུང་ངུ་ནས་བདེ་བའི་རླུང་གཏོང་བ།
en: A pleasant breeze blows across its arched gateways and its domed rooftops large and small.

source: རིན་པོ་ཆེའི་ཕྲེང་བ་བྲེས་པའི་སྒྲས་རྟག་ཏུ་མཛེས་པར་བྱས་པ།
en: It is always beautified by the sound of strings of jewels spread out like latticework.

source: དྲི་རབ་ཏུ་ཞིམ་པ་འབྱུང་བའི་སྤོས་དང་མེ་ཏོག་གི་སིལ་མ་འཐོར་བ་ཡིད་དུ་འོང་བ།
en: It is lovely and strewn with extremely fragrant perfumes and flower petals.

source: བཞིན་ཟླ་བ་དང་། ཉི་མ་དང་། མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟ་བུ། ལྷའི་ཁྱད་པར་གྱིས་གཟུགས་རབ་ཏུ་བརྒྱན་པའི་ལྷའི་བུ་མོ་དག་གནས་ཏེ།
en: The goddesses who dwell there have faces like the disk of the moon, the sun, or a mirror, and they have adorned their bodies with exceptional divine adornments. “

source: དྲང་སྲོང་ཆེན་པོ་ལྷའི་འདུན་ས་ཆོས་བཟངས་དེ་ན་ལྷའི་བུ་མོ་རོལ་མོའི་དབྱངས་སྒྲ་སྒྲོགས་སོ།
en: Great Seer, the divine meeting place of Sudharma rings with the melodies of the goddesses’ music.

source: །ལྷའི་འདུན་ས་ཆོས་བཟངས་དེ་ནི་གྲུ་བཞི་ལྷམ་པ། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ།
en: The divine meeting place Sudharma is square, and its layout is perfectly symmetrical.

source: ངོས་ཡངས་པ། ཤིང་ལྗོན་པ་དང་། སྐྱེད་མོས་ཚལ་དང་། ནགས་དང་། ནགས་ཚལ་གཞན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་མཛེས་པར་བྱས་པ།
en: Its surface is vast and adorned with various trees, gardens, glades, and woods.

source: རྒྱར་ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་བརྒྱ་ཡོད་པ། གསེར་དང་པད་མ་བཀྲམ་པ། མེ་ཏོག་སིལ་མ་བཀྲམ་པ།
en: It extends one hundred yojanas on all sides and is strewn with gold and lotuses and sprinkled with flower petals.

source: གླུ་དབྱངས་ཀྱི་སྒྲ་འབྱུང་བ། པད་མ་དང་ཤིང་ཡོངས་འདུ་ས་བརྟོལ་གྱིས་མཛེས་པར་བྱས་པའོ།
en: It rings with the sounds of singing and is beautified with lotuses and wish-fulfilling kovidāra trees. “

source: །ལྷའི་འདུན་ས་ཆོས་བཟངས་དེ་ནི་ཡོ་བྱད་ཀྱི་ཁྱད་པར་ཐམས་ཅད་གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་ལས་བྱས་པ།
en: All the material items in the divine meeting place of Sudharma are made from gold, silver, beryl, coral, and emerald.

source: རིན་པོ་ཆེའི་ཕུང་པོ་ཡོངས་སུ་བཟུང་བ། གསེར་གྱི་སྙིང་པོས་ཀུན་ཏུ་ཁྱབ་པ། རི་རྣམ་པ་དུ་མས་ཉེ་བར་བསྐོར་ཅིང་སྣ་ཚོགས་རྣམ་པར་བཀྲ་བས་མཛེས་པར་བྱས་པ།
en: It contains heaps of jewels and is permeated by deposits of gold, surrounded by numerous types of mountains, and decorated with various lovely colors.

source: ངོས་སྐྱེད་མོས་ཚལ་བརྒྱ་སྟོང་གིས་མཛེས་པར་བྱས་པ་སྟེ།
en: The surface is adorned with hundreds of thousands of gardens.

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་མྱ་ངན་དང་། ནད་ཀྱི་རྣམ་པའི་ཉེས་པ་ལས་གྲོལ་བ་དག་སྐྱེད་མོས་ཚལ་མཆོག་ཏུ་དགའ་འདུན་མྱོང་ནས་ལྷའི་འདུན་ས་ཆོས་བཟངས་དེར་འདུས་ཏེ་རྩེ་བ་རྗེས་སུ་མྱོང་ངོ་།
en: The gods of the Heaven of the Thirty-Three, who are free from all manner of faults related to pain and sickness, joyously congregate in that supreme garden and then gather and amuse themselves in the divine meeting place of Sudharma. “

source: །དྲང་སྲོང་ཆེན་པོ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་དེ་ན་བལྟ་ན་སྡུག་ཅེས་བྱ་བའི་གཞལ་མེད་ཁང་ཟླ་བ་དང་ཉི་མ་དང་། མེ་ལོང་གི་ངོས་ལྟར་དྲི་མ་མེད་པ།
en: Great Seer, in the Heaven of the Thirty-Three there is a divine palace called Beautiful to Behold that is immaculate like the surface of the moon, the sun, or a mirror.

source: དྲི་རབ་ཏུ་ཞིམ་པའི་སྤོས་དང་མེ་ཏོག་གིས་མཛེས་པར་བྱས་པ། ཕྲེང་བ་དང་བྱུག་པས་བྲེས་པས་མཛེས་པར་བྱས་པ།
en: It is beautified by very fragrant perfumes and flowers and decorated with garlands that are anointed and spread out like latticework.

source: བུད་མེད་བརྒྱ་སྟོང་གིས་མཛེས་པར་བྱས་པ། འཇོ་ཞིང་སྒེག་པ། མིག་ཟུར་གྱིས་ལྟ་ཞིང་ཁྲོ་གཉེར་གྱི་རིམ་པ་གཡོ་བའི་ཆ་བྱད་ཅན་འཁོད་པ།
en: It is adorned with hundreds of thousands of women who sit there, casting charming and affectionate sideways glances and feigning expressions of anger.

source: ངོས་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་ཕལ་པོ་ཆེས་མཛེས་པར་བྱས་པ།
en: Its surface is decorated with great heaps of various types of flowers.

source: ནོར་བུའི་སྐྱང་ནུལ་བྱས་པ།
en: The plaster on its walls is made from jewels.

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་བྲེས་པས་མཛེས་པར་བྱས་པ།
en: It is decorated with lattices of tinkling bells.

source: རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟའི་རྨིག་པས་རེག་ན་གསེར་གྱི་རྡུལ་ལྡང་བ་དང་། ཅོད་པན་ཆགས་ཤིང་འབྱོར་པས་མཛེས་པར་བྱས་པ་ཡོད་དོ།
en: The hooves of horses, elephants, and chariots kick up gold dust when they touch the ground, and the beings there wear crowns and are graced with great wealth. “

source: །དྲང་སྲོང་ཆེན་པོ་བལྟ་ན་སྡུག་ཅེས་བྱ་བའི་གཞལ་མེད་ཁང་དེ་ལ་ཀ་བ་དྲུག་ཁྲི་ཡོད་དེ། ཀ་ཞུ་ལྷའི་གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་ལས་བྱས་པ་སྣ་ཚོགས་ཀྱི་འཕྲས་རྣམ་པར་སྤྲས་པ།
en: Great Seer, the divine palace called Beautiful to Behold has sixty thousand pillars topped by capitals decorated with various inlays of divine gold, silver, and beryl.

source: ཤིང་ཏ་མ་ལའི་ལོ་མ་དང་། ཨ་ག་རུ་དང་། བདུག་པའི་ཕྲེང་བ་དྲི་རབ་ཏུ་ཞིམ་པར་བྱས་པའི་ཁྱད་པར་ཅན་ནོ།
en: Its garlands of tamāla leaf and aloeswood incense have a particularly delicious aroma. “

source: །གཞལ་མེད་ཁང་དེ་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གནས་ཏེ། ལྷའི་བུད་མེད་བརྒྱ་སྟོང་གིས་བསྐོར་བ།
en: Indra, the king of the gods, lives in that palace, surrounded by hundreds of thousands of divine women.

source: གསེར་དང་རྡོ་རྗེའི་མྱུ་གུས་ལུས་མཛེས་པར་བྱས་པ། ལྷའི་འདོད་པ་ལ་རྩེ་བ་རྗེས་སུ་མྱོང་བ།
en: His body is ornamented by shoots of gold and diamond, and he enjoys the sensuous play of the gods.

source: གླང་པོ་ཆེ་དགུ་ཁྲིའི་སྟོབས་དང་ལྡན་པ། ལག་པ་གླང་པོ་ཆེའི་སྣ་ལྟ་བུ།
en: He possesses the power of ninety thousand elephants, and his arms are like elephant trunks.

source: མདོག་གསེར་དྲི་མ་མེད་པ་ལྟར་སེར་བ། ལུས་གྲིམས་པ། རོ་སྟོད་སེང་གེའི་འདྲ་བ།
en: His complexion is yellow like pure gold, his body is taut, and his upper body is like the upper torso of a lion.

source: རྣ་ཆ་དྲི་མ་མེད་པ་འགུལ་བས་ལུས་སྣང་བར་བྱས་པ།
en: His earrings shimmer and illuminate his body.

source: གོས་མཆོག་ཏུ་ཕྲ་ལ་རིང་ཞིང་ནར་བ།
en: His exceedingly fine robes are long and trail behind him.

source: དབང་པོའི་བརྡ་སྤྲོད་པ་འདོད་ཅིང་བསྟན་བཅོས་ཤེས་ཤིང་མཁས་པ།
en: He upholds proper grammar, and he understands and has mastered its treatises.

source: ལྷའི་བུ་བརྒྱ་སྟོང་དུ་མ་རྗེས་སུ་འབྲང་ཞིང་ལྷའི་གསེར་གྱི་གཞལ་མེད་ཁང་གི་གནས་ན་རྒྱུ་བ།
en: Many hundreds of thousands of gods follow him and stroll about the grounds of his divine golden palace. “

source: གསེར་གྱི་སྐུད་པ་དང་། སེ་མོ་དོ་དང་། དོ་ཤལ་གྱིས་བྲང་བརྒྱན་ཅིང་མཛེས་པར་བྱས་པ།
en: His chest is beautifully ornamented with a golden thread and with short and long necklaces.

source: ཧ་ཅང་ཚོ་བ་ཡང་མ་ཡིན། ཧ་ཅང་རིང་བ་ཡང་མ་ཡིན་པ།
en: He is neither too heavy nor too tall.

source: རྐང་པ་ཤིན་ཏུ་གནས་པ།
en: His feet are firmly planted.

source: བདུད་རྩིའི་རོ་དང་ལྡན་པའི་ཁ་ཟས་ཟ་བ།
en: The food that he eats tastes like ambrosia.

source: མཁུར་ཙོས་བུད་མེད་བརྒྱ་སྟོང་གིས་ཟུར་གྱིས་ལྟ་བ་དང་ལྡན་པ། གླང་པོ་ཆེ་ས་སྲུང་གི་བུ་རྒྱགས་པའི་རྣ་བའི་རླུང་གིས་སྒྲ་ཕྱུང་བ་སྟེ།
en: Hundreds of thousands of maidens turn their cheeks to one side and gaze at him askance, and the gusts of wind from the ears of the rutting elephant Airāvaṇa make a thunderous sound. “

source: དྲང་སྲོང་ཆེན་པོ་ལྷའི་དབང་པོའི་རྒྱལ་པོ་དེའི་ལུས་ལ་རུས་པ་མེད་དོ།
en: Great Seer, the body of the king of the gods lacks deformities.

source: །དེའི་ལུས་ལ་ནད་ཐམས་ཅད་མེད་དེ། དྲི་རབ་ཏུ་ཞིམ་པ་དང་ལྡན་ལ་གདངས་ཤིན་ཏུ་སྙན་ཅིང་འཇམ་པའི་དབྱངས་དང་ལྡན་ནོ།
en: His body is entirely free of disease and has a very fragrant smell, and his voice has a sweet and gentle tone.

source: །ལྷའི་རྒྱལ་པོ་དེའི་ལུས་ཀྱི་དྲིས་ཕོག་ན་སྤོས་ཀྱི་གླང་པོ་ཆེ་རབ་ཏུ་རྒྱགས་ཤིང་བདོ་བ་ཡང་རྒྱགས་པ་ཡོངས་སུ་འབྲི་བར་འགྱུར་རོ།
en: Even a rampaging elephant in rut that is smeared with musk and in a frenzy is quelled when it makes contact with the scent of the king of the gods’ body. “

source: །དྲང་སྲོང་ཆེན་པོ་ལྷའི་དབང་པོ་དེའི་ལུས་ཀྱི་ཚད་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཚད་ཙམ་མོ།
en: Great Seer, the king of the gods’ body is roughly the same size as the body of the Tathāgata.

source: །དེའི་གཟུགས་ཆེ་བ་གསེར་གྱི་མདོག་ལྟ་བུ་དེ་མཐོང་ནས་འཕགས་པ་ཉན་ཐོས་རྣམས་ཀྱང་དེའི་གན་དུ་འདོང་སྟེ། ལྷའི་དབང་པོའི་གཟུགས་ཕུན་སུམ་ཚོགས་པ་དེ་བཞིན་གཤེགས་པ་དང་འདྲའོ་ཞེས་བརྗོད་དོ། །དེ་ནས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པས་ལྷའི་དབང་པོའི་ལུས་ཀྱི་ཚད་ཐོས་ནས་ངོ་མཚར་དུ་གྱུར་པ་དང་།
en: When they see Indra’s great golden body, even noble śrāvakas will come before him and say, ‘The excellent body of the king of the gods is like that of the Tathāgata.’ ”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དྲང་སྲོང་ཆེན་པོ་དབང་ཆེན་པོའི་ལུས་ཆུང་ངུ་མི་རྟག་པའི་རྗེས་སུ་འབྲང་བ་གར་མཁན་གྱི་ཆ་བྱད་ལྟ་བུར་ཤིན་ཏུ་སྤྲས་པ། གླེགས་ཤིང་གི་ལས་དང་། ཤིང་གི་ལས་དང་། འཁྲུལ་འཁོར་གྱི་ལས་ལྟ་བུར་བྱས་པ། མེ་ཏོག་གི་ལས་ལྟ་བུར་ཡུད་ཙམ་ཞིག་མཛེས་པ། མེ་ལོང་གི་ནང་གི་གཟུགས་བརྙན་ལྟ་བུ་ལ་ཁྱོད་ཅིའི་ཕྱིར་ངོ་མཚར་དུ་བྱེད།
en: The great seer Vyāsa was astounded when he heard about the size of the king of the gods’ body, so the Blessed One said, “Great Seer, why are you astounded by Great Indra’s trifling body, which is subject to impermanence, embellished like a performer’s prop, and constructed in the manner of fashioning a book cover, carving wood, or making a mechanical device, which, like a floral arrangement, is beautiful just for a short while, and which is like an image reflected in a mirror? “

source: དྲང་སྲོང་ཆེན་པོ་ཁྱོད་དགེ་སློང་མ་འགགས་པའི་ལུས་ཕ་དང་མ་ལས་སྐྱེས་པའི་ཚིགས་ཚིགས་མཚམས་མཚམས་རེ་རེ་ལ་ཡང་དབང་པོ་ཆེན་པོ་འདུན་པར་འགྱུར་བ་ལ་ལྟོས།
en: Great Seer, do you see how Great Indra fits in the spaces between each of the joints of the monk Aniruddha’s body, which was born from human parents?

source: དྲང་སྲོང་ཆེན་པོ་གཞན་ཡང་དགེ་སློང་མ་འགགས་པའི་ལུས་ལ་རྫུ་འཕྲུལ་གྱི་སྒྱུ་མ་ལ་ད་ལྟོས།
en: Moreover, Great Seer, look now at the magical illusory display in the monk Aniruddha’s body.”

source: དེ་ནས་དགེ་སློང་མ་འགགས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བསྐུལ་བར་ཤེས་ནས་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་དང་།
en: The monk Aniruddha, understanding that the Blessed One had made a request, entered into meditative absorption.

source: ཏིང་ངེ་འཛིན་དེའི་མཐུས་དགེ་སློང་མ་འགགས་པ་ལྷའི་གསེར་འབར་བ་དང་། བྱི་རུའི་སྡོང་པོའི་ཁ་དོག་མཆོག་དང་ལྡན་པ། གཙུག་གི་ནོར་བུ་དང་ཅོད་པན་འཕྱང་བའི་གཙུག་ཕུད་དང་ལྡན་པ། མཁུར་བ་རྒྱས་ཤིང་མདངས་སྣུམ་པའི་མདོག་ཅན། མིག་ལྷའི་ཨུད་པ་ལ་སྔོན་པོ་འདྲ་ལ། ནོར་བུ་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་དང་ལྡན་པའི་ཀླུའི་རྒྱལ་པོ་ལྟ་བུར་ཀུན་ཏུ་སྣང་སྟེ།
en: The power of that absorption allowed the monk Aniruddha to appear as a nāga king adorned with a divine golden glow, with a superior complexion like the trunk of a coral tree, with hair hanging down and bound up into a crown with a jeweled diadem, with broad cheeks and a bright and resplendent complexion, with eyes like divine blue lotuses, and with jewels, corals, and emeralds.

source: དེའི་གཟུགས་ཆེན་པོ་མངོན་པར་གྲུབ་པའི་ལྷའི་དྲི་དང་གཟུགས་ཀྱིས་འཁོར་ཐམས་ཅད་ལ་སྣང་བར་བྱས་པས་ངོ་མཚར་དང་དགའ་བར་གྱུར་ཏེ་དྲི་རབ་ཏུ་ཞིམ་པའི་དྲི་དང་ལྡན་པར་གྱུར་ཏོ།
en: The great bodily form and the divine appearance and fragrance he manifested appeared before the entire assembly and amazed and pleased them as its exceedingly sweet fragrance filled their ranks.

source: །དེའི་ཆོ་འཕྲུལ་དེ་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པས་མཐོང་ནས་སྙིང་འཕར་ཞིང་སྟན་ལས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས་རབ་ཏུ་ངོ་མཚར་དུ་གྱུར་པས་སྒྲ་ཆེར་ཀྱེ་ཨ་ལ་ལ་ལེགས་སོ།
en: When the great seer Vyāsa saw that marvel, his heart raced, and he rose from his seat, folded his hands, and, filled with great wonder, shouted, “Ah! Excellent!

source: །གང་གི་ཕྱིར་བདག་དེ་བཞིན་གཤེགས་པ་དང་ཕྲད་ཅིང་འདུས་ལ་ཐམས་ཅད་མཁྱེན་པའི་སྒོ་ནས་འདི་ལྟ་བུ་སྔོན་མ་མཐོང་བའི་ཆོ་འཕྲུལ་མཐོང་བ་མི་ཉིད་ཐོབ་པ་བདག་དོན་མཆིས་སོ།
en: Because of the Omniscient One, ever since I met the Tathāgata I have seen marvels in this assembly the likes of which I have never seen before. Today this human life I have obtained has become meaningful!” “Great Seer, what do you think?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: the Blessed One said to the great seer Vyāsa. “

source: །དྲང་སྲོང་ཆེན་པོ་འདི་ཇི་སྙམ་དུ་སེམས། དབང་པོ་ཆེན་པོའི་ལུས་དང་། གང་འདི་དགེ་སློང་མ་འགགས་པའི་ལུས་གསེར་འབར་བ་དང་། ནོར་བུ་མཆོག་ལས་གྲུབ་པ་འདི་གཉིས་གང་བཟང་།
en: Which is better, Great Indra’s body or the monk Aniruddha’s body of glowing gold, made of the finest jewels?”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་འདི་དགེ་སློང་མ་འགགས་པའི་ལུས་དེ་ལ་དབང་པོ་ཆེན་པོའི་ལུས་ཀྱིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་མཆི། སྟོང་གི་ཆ་དང་། བརྒྱ་སྟོང་གི་ཆའམ། གྲངས་སམ། ཆར་རམ། བགྲང་བར་རམ། དཔེར་ཡང་མི་བཟོད་དོ། །
en: The great seer Vyāsa replied to the Blessed One, “Blessed One, Indra’s body is not even close to a hundredth of the monk Aniruddha’s body—it cannot even bear comparison to a thousandth, or a hundred thousandth, or any number or fraction of that body.” “

source: དྲང་སྲོང་ཆེན་པོ་བསོད་ནམས་ལས་བསྒྲུབས་པའི་ལུས་ལ་དགེ་བའི་རྩ་བ་བསྔོས་པའི་ཁྱད་པར་ནི་དེ་ལྟར་བལྟའོ།
en: Great Seer, that is how you should see the superiority of dedicating roots of virtue in comparison to a body that has been attained as a result of meritorious karma. “

source: །དྲང་སྲོང་ཆེན་པོ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་དེ་ན། བརྒྱ་བྱིན་གྱི་ཆུང་མའི་དམ་པ་བདེ་སོགས་ཞེས་བྱ་བ་ལྷའི་བུ་མོ་བརྒྱ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཅིང་དགའ་ཚལ་ན་འདུག་སྟེ། ལུས་སྤོས་དང་། ཕྲེང་བ་དང་། མེ་ཏོག་གིས་བརྒྱན་ཅིང་འབར་བ།
en: Great Seer, Indra’s highest consort, Śacī, dwells in a garden grove in the Heaven of the Thirty-Three, surrounded by hundreds of thousands of goddesses with radiant bodies ornamented with perfumes, garlands, and flowers.

source: ལྷའི་མེ་ཏོག་པད་མ་དང་། ཨུད་པ་ལ་དྲི་རབ་ཏུ་ཞིམ་པའི་དྲི་དང་ལྡན་པ།
en: They are perfumed with the highly fragrant scents of divine red and blue lotuses.

source: མཆུ་གསེར་དང་བིམ་པ་འདྲ་བ།
en: Their lips are golden and shaped like bilva fruit.

source: མཆོག་ཏུ་འབར་བའི་ཆ་བྱད་འཛིན་པ། མཆོག་ཏུ་ཕྲལ་འཚེར་བ།
en: The supremely radiant clothes they wear are extremely fine and sheer.

source: སྐྱེད་མོས་ཚལ་དང་ནགས་ན་རྒྱུ་བ། ལྷའི་རྒྱན་དང་། རྐང་གདུབ་དང་། གདུ་བུ་དང་། གདུ་བུ་བསྒྲིལ་མ་དང་། དོ་ཤལ་དང་། སེ་མོ་དོས་ལུས་དུད་པ། འཕྲལ་བ་དང་མཁུར་བ་ཆེ་ལ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། ནོར་བུ་དང་གསེར་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་སྐ་རགས་ཀྱིས་བཅིངས་པ་འཇོ་ཞིང་སྒེག་པའི་རྗེས་སུ་ཆགས་པ། མིག་རིང་ཞིང་ཕྱེ་ལ་འཛུམ་པ། ལག་པའི་ནང་རི་མོ་རིང་པོས་ཁྱབ་པ།
en: Their bodies bend from the weight of their divine ornaments, anklets, bracelets, twisted bracelets, and long and short necklaces as they stroll about in the gardens and forests. “ Their foreheads and cheeks are large and perfectly symmetrical. They bind their waists with a belt of evenly spaced gold and jewels, and they are charming and affectionate. Their eyes are long and wide-open as they smile, and their hands are covered with elongated patterns.

source: ལྟེ་བ་ཟབ་པ། ཁྲོ་བ་དང་། སེར་སྣ་དང་། ཕྲག་དོག་དང་། འཐབ་པ་དང་། རྩོད་པའི་ཉེས་པ་སྤངས་པ། བཞིན་ཁྲོ་གཉེར་གྱི་རིམ་པ་གཡོ་བ་དང་བྲལ་བ། མངལ་འཛིན་པའི་སྐྱོན་རྣམ་པར་སྤངས་པའི་ལུས་དང་ལྡན་པའོ།
en: Their navels are deep, and they lack the faults related to anger, jealousy, envy, fighting, and quarreling. Their faces are free from feigning the stages of expressing anger, and they have bodies that are completely devoid of the defects related to having borne a child. “

source: །ལྷའི་བུ་མོ་བདེ་སོགས་ཞེས་བྱ་བ་དེ་ཤིན་ཏུ་འདོད་པ་ལ་ཆགས་པ་ལས་བྱུང་བའི་སྒེག་པ། རི་རབ་ལ་ཡོད་པའི་གཞལ་མེད་ཁང་དང་། ཤིང་གེལ་པ་དང་འཁྲི་ཤིང་གི་བླ་རེས་ཁེབས་པར་བྱས་པ་ལས་བྱུང་བའི་འདོད་པ་སྐྱེས་པས་བྱུང་བ།
en: The divine maiden Śacī’s affectionate air comes from the longing for intense passion that arose when she experienced passionate desire after leaving the palace on Sumeru and taking shelter under a canopy of vines and branches.

source: མེ་ཏོག་འཐོར་བ་དང་བཅས་པའི་རླུང་ལྡང་བ།
en: She is like a gentle breeze filled with scattered flowers.
